// Выбираем все элементы кнопок листов в режиме dashboard-viewer
const sheets = document.querySelectorAll('.va-sheet-tab');
sheets.forEach((s, i) => {
    // Обходим весь список листов и "цепляемся" к выбранному в текущий момент
    if (s.classList.contains('selected')) {
        // Навешиваем на него таймаут, который проверяет что это не последний элемент в списке
        // и если это так то совершает "клик" на следующий элемент,
        // а если последний, то на первый элемент в списке
        setTimeout(() => {
            if (i !== sheets.length - 1) {
                sheets[i+1].click();
            } else {
                sheets[0].click();
            }
        }, 5000); // Задержка между переключениями в примере - 5 секунд.
    }
});